# Introduction of data

In [1]:
import pandas as pd
US_births_1994_2003 = pd.read_csv('US_births_1994-2003_CDC_NCHS.csv')
US_births_2000_2014 = pd.read_csv('US_births_2000-2014_SSA.csv')

In [2]:
US_births_1994_2003.head()

   year  month  date_of_month  day_of_week  births
0  1994      1              1            6    8096
1  1994      1              2            7    7772
2  1994      1              3            1   10142
3  1994      1              4            2   11248
4  1994      1              5            3   11053

In [3]:
US_births_2000_2014.head()

   year  month  date_of_month  day_of_week  births
0  2000      1              1            6    9083
1  2000      1              2            7    8006
2  2000      1              3            1   11363
3  2000      1              4            2   13032
4  2000      1              5            3   12558

In [7]:
US_births_1994_2003[US_births_1994_2003['year'] == 2000].head()

      year  month  date_of_month  day_of_week  births
2191  2000      1              1            6    8843
2192  2000      1              2            7    7816
2193  2000      1              3            1   11123
2194  2000      1              4            2   12703
2195  2000      1              5            3   12240

In [9]:
US_births_1994_2003.columns

Index(['year', 'month', 'date_of_month', 'day_of_week', 'births'], dtype='object')

# Dealing with overlap
There is a overlap between the datasets and the number of births is not the same. make a new dataset with average births for the overlapping period.

In [15]:
import numpy as np
#select parts where the two df do not overlap
data94_99 = US_births_1994_2003[US_births_1994_2003['year'].between(1994,1999)] 
data04_14 = US_births_2000_2014[US_births_2000_2014['year'].between(2004,2014)]

# select parts where the two df overlap
data00_03_94 = US_births_1994_2003[US_births_1994_2003['year'].between(2000,2003)] 
data00_03_14 = US_births_2000_2014[US_births_2000_2014['year'].between(2000,2003)]

# get the values of birth column
births_94_03 = data00_03_94['births'].values
births_00_14 = data00_03_14['births'].values
# get average biths from 2000-2003
births00_03 = (births_94_03 + births_00_14) / 2

#select first 4 columns and make a df for period 2000-2003
data00_03 = data00_03_94[['year', 'month', 'date_of_month', 'day_of_week']]

#add the new column with average births 
data00_03['births'] = births00_03

#merging all the data into one df
frames = [data94_99,data00_03,data04_14]
data = pd.concat(frames)

print(data94_99.shape)
print(data00_03.shape)
print(data04_14.shape)
print(data.shape)
data.head()

(2191, 5)
(1461, 5)
(4018, 5)
(7670, 5)

   year  month  date_of_month  day_of_week   births
0  1994      1              1            6   8096.0
1  1994      1              2            7   7772.0
2  1994      1              3            1  10142.0
3  1994      1              4            2  11248.0
4  1994      1              5            3  11053.0

# Analysis

## Number of births per month

In [16]:
total_births_month = data.pivot_table(index='month', values='births', aggfunc= sum)
print(total_births_month.sort_values('births', ascending=False))

          births
month
8      7610274.0
7      7514039.5
9      7425979.0
10     7278954.5
5      7162957.0
12     7139173.5
3      7134653.0
6      7110327.5
1      6965337.0
11     6869516.5
4      6838788.0
2      6499483.0

## Total number of days per month

In [17]:
data['month'].value_counts()

7     651
3     651
10    651
5     651
1     651
12    651
8     651
11    630
6     630
9     630
4     630
2     593
Name: month, dtype: int64

## Average births per day in a month

In [18]:
avr_birth_month = data.pivot_table(index='month', values='births')
print(avr_birth_month.sort_values('births', ascending=False))

             births
month
9      11787.268254
8      11690.129032
7      11542.303379
6      11286.234127
10     11181.189708
5      11003.006144
12     10966.472350
2      10960.342327
3      10959.528418
11     10903.994444
4      10855.219048
1      10699.442396